implement-verify-service/test-results/csharp-repo/pipeline-output/dotnet-eShop/test/diagrams/package-structure.mmd
graph TD
    src_Basket_API["src/Basket.API"] --> src_Basket_API_Extensions["src/Basket.API/Extensions"]
    src_Basket_API["src/Basket.API"] --> src_Basket_API_Grpc["src/Basket.API/Grpc"]
    src_Basket_API["src/Basket.API"] --> src_Basket_API_Model["src/Basket.API/Model"]
    src_Basket_API["src/Basket.API"] --> src_Basket_API_Repositories["src/Basket.API/Repositories"]
    src_Catalog_API["src/Catalog.API"] --> src_Catalog_API_Apis["src/Catalog.API/Apis"]
    src_Catalog_API["src/Catalog.API"] --> src_Catalog_API_Extensions["src/Catalog.API/Extensions"]
    src_Catalog_API["src/Catalog.API"] --> src_Catalog_API_Infrastructure["src/Catalog.API/Infrastructure"]
    src_Catalog_API_Infrastructure["src/Catalog.API/Infrastructure"] --> src_Catalog_API_Infrastructure_EntityConfigurations["src/Catalog.API/Infrastructure/EntityConfigurations"]
    src_Catalog_API_Infrastructure["src/Catalog.API/Infrastructure"] --> src_Catalog_API_Infrastructure_Exceptions["src/Catalog.API/Infrastructure/Exceptions"]
    src_Catalog_API_Infrastructure["src/Catalog.API/Infrastructure"] --> src_Catalog_API_Infrastructure_Migrations["src/Catalog.API/Infrastructure/Migrations"]
    src_Catalog_API["src/Catalog.API"] --> src_Catalog_API_IntegrationEvents["src/Catalog.API/IntegrationEvents"]
    src_Catalog_API_IntegrationEvents["src/Catalog.API/IntegrationEvents"] --> src_Catalog_API_IntegrationEvents_EventHandling["src/Catalog.API/IntegrationEvents/EventHandling"]
    src_Catalog_API_IntegrationEvents["src/Catalog.API/IntegrationEvents"] --> src_Catalog_API_IntegrationEvents_Events["src/Catalog.API/IntegrationEvents/Events"]
    src_Catalog_API["src/Catalog.API"] --> src_Catalog_API_Model["src/Catalog.API/Model"]
    src_Catalog_API["src/Catalog.API"] --> src_Catalog_API_Services["src/Catalog.API/Services"]
